{
  "activation_dropout": 0.0,
  "activation_function": "gelu",
  "architectures": [
    "ParlerTTSForCausalLM"
  ],
  "attention_dropout": 0.0,
  "bos_token_id": 1025,
  "dropout": 0.0,
  "eos_token_id": 1024,
  "ffn_dim": 512,
  "hidden_size": 512,
  "initializer_factor": 0.02,
  "layerdrop": 0.0,
  "max_position_embeddings": 2048,
  "model_type": "parler_tts_decoder",
  "num_attention_heads": 8,
  "num_codebooks": 9,
  "num_hidden_layers": 4,
  "pad_token_id": 1024,
  "scale_embedding": false,
  "tie_word_embeddings": false,
  "torch_dtype": "float32",
  "transformers_version": "4.40.2",
  "use_cache": true,
  "vocab_size": 1025
}
